emacs/dot-emacs.d/config.org
#+TITLE: ARG Emacs
#+AUTHOR: Adam Grubbs
:PROPERTIES:
#+PROPERTY: header-args :tangle config.el
#+STARTUP: contents
#+RESULTS: silent
:END:

* Emacs Configuration

** Base Settings

*** Set initial mode to Org
#+begin_src emacs-lisp
  (setq initial-major-mode 'org-mode)
#+end_src

** UI

*** Theme

**** Declare all themes as safe

     To avoid being asked about setting a theme as safe, I set this
     If you need to load a new theme, you won't have to set it with
     =(load-theme 'theme-name :no-confirm)=. Built-in themes are
     safe by default.

     #+begin_src emacs-lisp
     (setq custom-safe-themes t)
     #+end_src


**** Install Themes
Install various themes
#+begin_src emacs-lisp
  (use-package doom-themes)
  (straight-use-package '(moe-theme :host github
  				  :repo "kuanyui/moe-theme.el"
  				  :branch "dev"))
  (use-package ef-themes
    :init
    (ef-themes-take-over-modus-themes-mode 1)
    :config
    (setq modus-themes-mixed-fonts t)
    (setq modus-themes-italic-constructs t))
#+end_src

#+RESULTS:
: t

**** Load my theme
#+begin_src emacs-lisp
  (load-theme 'moe-dark t)
#+end_src

*** Fonts

    #+begin_src emacs-lisp
    (when (member "Iosevka Nerd Font Mono" (font-family-list))
      (set-face-attribute 'default nil :family "Iosevka Nerd Font" :height 200 :weight 'semi-light)
      (set-face-attribute 'fixed-pitch nil :family "Iosevka Nerd Font Mono" :height 200))

    (when (member "Caveat" (font-family-list))
      (set-face-attribute 'font-lock-comment-face nil :font "Futura-20"))

    (when (member "Iosevka Nerd Font" (font-family-list))
      (set-face-attribute 'variable-pitch nil :family "American Typewriter" :height 220))

    ;; Resize Org headings
    (dolist (face '((org-level-1 . 1.35)
                    (org-level-2 . 1.3)
                    (org-level-3 . 1.2)
                    (org-level-4 . 1.1)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Iosevka Nerd Font" :weight 'bold :height (cdr face)))

    ;; Make the document title a bit bigger
    (set-face-attribute 'org-document-title nil :font "Iosevka Nerd Font" :weight
    		    'bold :height 1.8)

    (require 'org-indent)
    (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))

    (set-face-attribute 'org-block nil            :foreground nil :inherit
    		    'fixed-pitch :height 0.85)
    (set-face-attribute 'org-code nil             :inherit '(shadow fixed-pitch) :height 0.85)
    (set-face-attribute 'org-indent nil           :inherit '(org-hide fixed-pitch) :height 0.85)
    (set-face-attribute 'org-verbatim nil         :inherit '(shadow fixed-pitch) :height 0.85)
    (set-face-attribute 'org-special-keyword nil  :inherit '(font-lock-comment-face
    							 fixed-pitch))
    (set-face-attribute 'org-meta-line nil        :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil         :inherit 'fixed-pitch)

    (add-hook 'org-mode-hook 'variable-pitch-mode)

    #+End_Src

    #+RESULTS:
    | variable-pitch-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |


*** Nerd Icons

    #+begin_src emacs-lisp
    (use-package nerd-icons
      :straight t)
    #+end_src

*** Modeline

*** Extras

**** Zoom

Package that handles automatic window sizing based on active window

     #+begin_src emacs-lisp
     (use-package zoom
       :init
       (zoom-mode t)
       :config
       (custom-set-variables
        '(zoom-size '(0.618 . 0.618))))
     #+end_src

**** Posframe

     #+begin_src emacs-lisp
(use-package posframe
  :straight t
  :config
  ;; Global posframe settings
  
  ;; Default position handler for all posframes
  (setq posframe-mouse-banish t)  ; Move mouse away from posframe
  
  ;; Default parameters for all posframes
  (setq-default posframe-arghandler
                (lambda (buffer-or-name key value)
                  (or (and (eq key :internal-border-width) 10)
                      (and (eq key :internal-border-color) "#51afef")
                      (and (eq key :background-color) "#282c34")
                      value)))
  
  ;; Posframe border style
  (setq posframe-border-width 2)
  
  ;; Hide posframe on specific events
  (add-hook 'posframe-hide-hook
            (lambda () (set-cursor-color "white"))))
     #+end_src

*** Editor settings tweaks
Need to enable line numbers, column numbers, and a size indicator
#+begin_src emacs-lisp
  (line-number-mode t)
  (column-number-mode t)
  (size-indication-mode t)
#+end_src

Highlight line mode
#+begin_src emacs-lisp
  (hl-line-mode t)
#+end_src

Enable recent files mode
#+begin_src emacs-lisp
(recentf-mode t)
#+end_src

** Editing

*** expand-region
      #+begin_src emacs-lisp
      (use-package expand-region
	:straight t
	:bind (("C-=" . er/expand-region)))
      #+end_src

*** save-place-move
     #+begin_src emacs-lisp
     (save-place-mode 1)
     #+end_src

*** beacon
     #+begin_src emacs-lisp
     (use-package beacon
       :straight t
       :init
       (beacon-mode 1))
     #+end_src

   These packages ars focused on providing a better experience for completion
   in the minibuffer, editor, and anywhere else

*** General settings

    These setting remove case sensitivity from completions

    #+begin_src emacs-lisp
    (setq read-file-name-completion-ignore-case t
          read-buffer-completion-ignore-case t
          completion-ignore-case t)
    #+end_src

    #+RESULTS:
    : t
** Completion
*** Vertico

    Vertico provides a cleaner minibuffer completion framework. Check [[roam:emacs-package-vertico][Vertico Notes]] for more info.

    #+begin_src emacs-lisp
    (use-package vertico
      :custom
      (vertico-cycle t)
      :init
      (vertico-mode)
      :bind (:map vertico-map
    	      ("TAB" . #'minibuffer-complete)
    	      ("RET" . #'vertico-directory-enter)
    	      ("DEL" . #'vertico-directory-delete-char)
    	      ("M-DEL" . #'vertico-directory-delete-word))
      :hook ((rfn-eshadow-update-overlay . #'vertico-directory-tidy)
    	 (minibuffer-setup . #'vertico-repeat-save))
      :config
      (setq vertico-resize nil
    	vertico-count 17
    	vertico-cycle t)
      (setq-default completion-in-region-function
    		(lambda (&rest args)
    		  (apply (if vertico-mode
    			     #'consult-completion-in-region
    			   #'completion--in-region)
    			 args))))

    (use-package savehist
      :init
      (savehist-mode))

    (use-package emacs
      :custom
      (context-menu-mode t)
      (enable-recursive-minibuffers t)
      (read-extended-command-predicate #'command-completion-default-include-p)
      (minibuffer-prompt-properties
       '(read-only t cursor-intangible t face minibuffer-prompt)))
    #+end_src

    #+RESULTS:

*** Orderless

    Orderless provides completion styles to make fuzzy finding and completion feel more natural

    #+begin_src emacs-lisp
    (use-package orderless
      :init
      (setq completion-styles '(orderless basic)
    	completion-category-defaults nil
    	completion-category-overrides '((command (styles orderless))
    					(file (styles partial-completion)))
    	completion-pcm-leading-wildcard t)
      :config
      (setq orderless-matching-styles '(orderless-literal orderless-regexp orderless-flex)))
    #+end_src

    #+RESULTS:
    : t

*** Marginalia

    Marginalia provides extra info into the minibuffer completions. It's really just that.

    #+begin_src emacs-lisp
    (use-package marginalia
      :bind (:map minibuffer-local-map
    	      ("M-A" . marginalia-cycle))
      :init
      (marginalia-mode))

    (use-package nerd-icons-completion
      :hook (marginalia-mode . nerd-icons-completion-marginalia-setup)
      :config
      (nerd-icons-completion-mode))

    (use-package all-the-icons-completion
      :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
      :init
      (all-the-icons-completion-mode))
    #+end_src

    #+RESULTS:
    | all-the-icons-completion-marginalia-setup | nerd-icons-completion-marginalia-setup |

