emacs/dot-emacs.d/config.el
(setq initial-major-mode 'org-mode)

(setq custom-safe-themes t)

(use-package doom-themes)
(straight-use-package '(moe-theme :host github
				  :repo "kuanyui/moe-theme.el"
				  :branch "dev"))
(use-package ef-themes
  :init
  (ef-themes-take-over-modus-themes-mode 1)
  :config
  (setq modus-themes-mixed-fonts t)
  (setq modus-themes-italic-constructs t))

(load-theme 'moe-dark t)

(when (member "Iosevka Nerd Font Mono" (font-family-list))
  (set-face-attribute 'default nil :family "Iosevka Nerd Font" :height 200 :weight 'semi-light)
  (set-face-attribute 'fixed-pitch nil :family "Iosevka Nerd Font Mono" :height 200))

(when (member "Caveat" (font-family-list))
  (set-face-attribute 'font-lock-comment-face nil :font "Futura-20"))

(when (member "Iosevka Nerd Font" (font-family-list))
  (set-face-attribute 'variable-pitch nil :family "American Typewriter" :height 220))

;; Resize Org headings
(dolist (face '((org-level-1 . 1.35)
                (org-level-2 . 1.3)
                (org-level-3 . 1.2)
                (org-level-4 . 1.1)
                (org-level-5 . 1.1)
                (org-level-6 . 1.1)
                (org-level-7 . 1.1)
                (org-level-8 . 1.1)))
  (set-face-attribute (car face) nil :font "Iosevka Nerd Font" :weight 'bold :height (cdr face)))

;; Make the document title a bit bigger
(set-face-attribute 'org-document-title nil :font "Iosevka Nerd Font" :weight
		    'bold :height 1.8)

(require 'org-indent)
(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))

(set-face-attribute 'org-block nil            :foreground nil :inherit
		    'fixed-pitch :height 0.85)
(set-face-attribute 'org-code nil             :inherit '(shadow fixed-pitch) :height 0.85)
(set-face-attribute 'org-indent nil           :inherit '(org-hide fixed-pitch) :height 0.85)
(set-face-attribute 'org-verbatim nil         :inherit '(shadow fixed-pitch) :height 0.85)
(set-face-attribute 'org-special-keyword nil  :inherit '(font-lock-comment-face
							 fixed-pitch))
(set-face-attribute 'org-meta-line nil        :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil         :inherit 'fixed-pitch)

(add-hook 'org-mode-hook 'variable-pitch-mode)

(use-package nerd-icons
  :straight t)

(use-package zoom
  :init
  (zoom-mode t)
  :config
  (custom-set-variables
   '(zoom-size '(0.618 . 0.618))))

(use-package posframe
  :straight t
  :config
  ;; Global posframe settings
  
  ;; Default position handler for all posframes
  (setq posframe-mouse-banish t)  ; Move mouse away from posframe
  
  ;; Default parameters for all posframes
  (setq-default posframe-arghandler
                (lambda (buffer-or-name key value)
                  (or (and (eq key :internal-border-width) 10)
                      (and (eq key :internal-border-color) "#51afef")
                      (and (eq key :background-color) "#282c34")
                      value)))
  
  ;; Posframe border style
  (setq posframe-border-width 2)
  
  ;; Hide posframe on specific events
  (add-hook 'posframe-hide-hook
            (lambda () (set-cursor-color "white"))))

(line-number-mode t)
(column-number-mode t)
(size-indication-mode t)

(hl-line-mode t)

(recentf-mode t)

(use-package expand-region
	:straight t
	:bind (("C-=" . er/expand-region)))

(save-place-mode 1)

(use-package beacon
  :straight t
  :init
  (beacon-mode 1))

(setq read-file-name-completion-ignore-case t
      read-buffer-completion-ignore-case t
      completion-ignore-case t)

(use-package vertico
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode)
  :bind (:map vertico-map
	      ("TAB" . #'minibuffer-complete)
	      ("RET" . #'vertico-directory-enter)
	      ("DEL" . #'vertico-directory-delete-char)
	      ("M-DEL" . #'vertico-directory-delete-word))
  :hook ((rfn-eshadow-update-overlay . #'vertico-directory-tidy)
	 (minibuffer-setup . #'vertico-repeat-save))
  :config
  (setq vertico-resize nil
	vertico-count 17
	vertico-cycle t)
  (setq-default completion-in-region-function
		(lambda (&rest args)
		  (apply (if vertico-mode
			     #'consult-completion-in-region
			   #'completion--in-region)
			 args))))

(use-package savehist
  :init
  (savehist-mode))

(use-package emacs
  :custom
  (context-menu-mode t)
  (enable-recursive-minibuffers t)
  (read-extended-command-predicate #'command-completion-default-include-p)
  (minibuffer-prompt-properties
   '(read-only t cursor-intangible t face minibuffer-prompt)))

(use-package orderless
  :init
  (setq completion-styles '(orderless basic)
	completion-category-defaults nil
	completion-category-overrides '((command (styles orderless))
					(file (styles partial-completion)))
	completion-pcm-leading-wildcard t)
  :config
  (setq orderless-matching-styles '(orderless-literal orderless-regexp orderless-flex)))

(use-package marginalia
  :bind (:map minibuffer-local-map
	      ("M-A" . marginalia-cycle))
  :init
  (marginalia-mode))

(use-package nerd-icons-completion
  :hook (marginalia-mode . nerd-icons-completion-marginalia-setup)
  :config
  (nerd-icons-completion-mode))

(use-package all-the-icons-completion
  :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
  :init
  (all-the-icons-completion-mode))

(use-package consult
