emacs/dot-emacs.d/config.org
*** Consult

    Consult provides search and navigation commands based on the Emacs completion function [[help:completing-read][completing-read]]. Check out [[id:2F9DB448-1184-4DB2-8C21-B54023F292CC][Consult]] for more.

    #+begin_src emacs-lisp
    (use-package consult
      :bind (:map global-map
    	      ("M-g M-g" . consult-goto-line)
    	      ("M-s M-b" . consult-buffer)
    	      ("M-s M-f" . consult-find)
    	      ("M-s M-g" . consult-ripgrep)
    	      ("M-s M-h" . consult-history)
    	      ("M-s M-i" . consult-imenu)
    	      ("M-s M-l" . consult-line)
    	      ("M-s M-m" . consult-mark)
    	      ("M-s M-y" . consult-yank-pop)
    	      ("M-s M-s" . consult-outline)
    	      :map consult-narrow-map
    	      ("?" . consult-narrow-help))
      :hook (completion-list-mode . consult-preview-at-point-mode)
      :init
      (setq register-preview-delay 0.5
    	register-preview-function #'consult-register-format)
      (advice-add #'retister-preview :override #'consult-register-window)
      (setq xref-show-xrefs-function #'consult-xref
    	xref-show-definitions-function #'consult-xref)
      :config
      (setq consult-line-numbers-widen t)
      (setq consult-async-min-input 3)
      (setq consult-async-input-debounce 0.5)
      (setq consult-async-input-throttle 0.8)
      (setq consult-narrow-key nil)
      (setq consult-find-args
    	(concat "find . -not ( "
    		"-path */.git* -prune "
    		"-or -path */.cache* -prune )"))
      (setq consult-preview-key 'any)
      (add-to-list 'consult-mode-histories '(vc-git-log-edit-mode . log-edit-comment-ring))
      (require 'consult-imenu)


      (use-package consult-org-roam
        :bind (("M-s M-o f" . consult-org-roam-file-find)
    	   ("M-s M-o l" . consult-org-roam-forward-links)
    	   ("M-s M-o b" . consult-org-roam-backlinks)
    	   ("M-s M-o s" . consult-org-roam-search)
    	   ("M-s M-o l" . consult-org-roam-backlinks-recursive))
        :init
        (consult-org-roam-mode))

      (use-package consult-dir
        :straight t
        :bind (("C-x C-d" . consult-dir)
    	   :map minibuffer-local-completion-map
    	   ("C-x C-d" . consult-dir)
    	   ("C-x C-f" . consult-dir-jump-file))))
    #+end_src

    #+RESULTS:
    : consult-narrow-help
    
*** Corfu

    Corfu is an in-buffer completion framework that provides a completion popup.

    #+begin_src emacs-lisp
	    (use-package corfu
      :straight t
      :custom
      (corfu-auto t)
      (corfu-cycle t)
      (corfu-auto-delay 0)
      (corfu-auto-prefix 0)
      (corfu-popupinfo-delay '(0.5 . 0.2))
      (tab-always-indent 'complete)
      (completion-cycle-threshold nil)
      (corfu-echo-mode nil)
      (defun my-corfu-complete-all ()
        "Show all completions at point."
        (interactive)
        (let ((corfu-auto-prefix 0))
          (completion-at-point)))

      (global-set-key (kbd "M-/") #'my-corfu-complete-all)
      :bind
      (:map corfu-map
            ("M-p" . corfu-popupinfo-scroll-down)
            ("M-n" . corfu-popupinfo-scroll-up)
            ("M-d" . corfu-popupinfo-toggle))
      :init
      (global-corfu-mode)
      (corfu-popupinfo-mode 1)
      (corfu-history-mode 1))

    (use-package nerd-icons-corfu
      :straight t
      :after corfu
      :config
      (setq corfu-margin-formatters '(nerd-icons-corfu-formatter)))

    (use-package emacs
      :init
      (setq completion-cycle-threshold 3)
      (setq tab-always-indent 'complete))

    (use-package dabbrev
      :bind (("C-<tab>" . dabbrev-completion)
             ("C-M-<tab>" . dabbrev-expand))
      :config
      (add-to-list 'dabbrev-ignored-buffer-regexps "\\` ") 
      (add-to-list 'dabbrev-ignored-buffer-modes 'doc-view-mode)
      (add-to-list 'dabbrev-ignored-buffer-modes 'pdf-view-mode))
    #+end_src

    #+RESULTS:
    : dabbrev-expand

    Nerd icons in Corfu

    #+begin_src emacs-lisp
    (use-package nerd-icons-corfu
      :ensure
      :config
      (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter)
      (setq nerd-icons-corfu-mapping
    	'((array :style "cod" :icon "symbol_array" :face font-lock-type-face)
    	  (boolean :style "cod" :icon "symbol_boolean" :face font-lock-builtin-face)
    	  ;; ...
    	  (t :style "cod" :icon "code" :face font-lock-warning-face))))
    #+end_src

    #+RESULTS:

*** Cape

    Cape (Completion-at-Point Extensions) are providers for Corfu completion

    #+begin_src emacs-lisp
    (use-package cape
      :bind (("C-c p p" . completion-at-point)
    	 ("C-c p t" . complete-tag)
    	 ("C-c p d". cape-dabbrev)
    	 ("C-c p h" . cape-history)
    	 ("C-c p f" . cape-file)
    	 ("C-c p k" . cape-keyword)
    	 ("C-c p s" . cape-elisp-symbol)
    	 ("C-c p e" . cape-elisp-block)
    	 ("C-c p a" . cape-abbrev)
    	 ("C-c p l" . cape-line)
    	 ("C-c p w" . cape-dict)
    	 ("C-c p :" . cape-emoji)
    	 ("C-c p \\" . cape-tex)
    	 ("C-c p _" . cape-tex)
    	 ("C-c p ^". cape-tex)
    	 ("C-c p &" . cape-sgml)
    	 ("C-c p r" . cape-rfc1345))
      
      :init
      (advice-add 'eglot-completion-at-point :around #'cape-wrap-buster)
      ;;(add-hook 'completion-at-point-functions #'cape-dabbrev t)
      (add-hook 'emacs-lisp-mode-hook
    	    (lambda ()
    	            (add-hook 'completion-at-point-functions #'cape-elisp-block nil t)
    		    (add-hook 'completion-at-point-functions #'cape-elisp-symbol nil t)))
      (add-hook 'org-mode-hook
          (lambda ()
            (add-hook 'completion-at-point-functions #'cape-emoji nil t)
    	(add-hook 'completion-at-point-functions #'org-roam-complete-link-at-point nil t)))
        (add-hook 'prog-mode-hook
            (lambda ()
              (add-hook 'completion-at-point-functions #'cape-file 90 t)))

    	      


      ;;(add-to-list 'completion-at-point-functions #'cape-history)
      ;;(add-hook 'completion-at-point-functions #'cape-keyword t)
      ;;(add-to-list 'completion-at-point-functions #'cape-tex)
      ;;(add-to-list 'completion-at-point-functions #'cape-sgml)
      ;;(add-to-list 'completion-at-point-functions #'cape-rfc1345)
      ;;(add-to-list 'completion-at-point-functions #'cape-abbrev)
      ;;(add-to-list 'completion-at-point-functions #'cape-dict)
      ;;(add-to-list 'completion-at-point-functions #'cape-elisp-symbol)
      ;;(add-to-list 'completion-at-point-functions #'cape-line)
      )
    #+end_src

    #+RESULTS:
    : cape-rfc1345
    
*** Set exec-path from shell

    #+begin_src emacs-lisp
    (use-package exec-path-from-shell
      :straight t
      :init
      (exec-path-from-shell-initialize))
   #+end_src

   #+RESULTS:
   : ((MANPATH . :/usr/share/man:/usr/local/share/man:/Library/TeX/Distributions/.DefaultTeX/Contents/Man:) (PATH . /opt/homebrew/bin:/opt/homebrew/sbin:/Users/adamgrubbs/.npm-global/bin:/Users/adamgrubbs/.local/bin:/Users/adamgrubbs/.config/emacs/bin:/opt/homebrew/lib/node_modules:/usr/local/bin:/System/Cryptexes/App/usr/bin:/usr/bin:/bin:/usr/sbin:/sbin:/var/run/com.apple.security.cryptexd/codex.system/bootstrap/usr/local/bin:/var/run/com.apple.security.cryptexd/codex.system/bootstrap/usr/bin:/var/run/com.apple.security.cryptexd/codex.system/bootstrap/usr/appleinternal/bin:/Library/TeX/texbin))

*** Embark
    #+begin_src emacs-lisp
    (use-package embark
        :straight t
        :bind (("C-." . embark-act)
               ("M-." . embark-dwim)
               ("C-h B" . embark-bindings))
        :config
        (setq embark-indicators
              '(embark-minimal-indicator
                embark-highlight-indicator
                embark-isearch-highlight-indicator))
        (setq embark-prompter 'embark-completing-read-prompter))

        ;; Embark + Consult integration (must-have)
    (use-package embark-consult
      :straight t
      :after (embark consult)
      :hook (embark-collect-mode . consult-preview-at-point-mode))


    #+end_src


** Navigation

*** avy
     #+begin_src emacs-lisp
            (use-package avy
            :straight t
            :bind (("C-;" . avy-goto-char-timer)
                   ("C-:" . avy-goto-line)
                   ("M-g w" . avy-goto-word-1)
                   ("M-g c" . avy-goto-char-2))
            :config
            (setq avy-background t)
            (setq avy-style 'at-full)
            (setq avy-timeout-seconds 0.5)
            (setq avy-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))

            ;; avy-zap - Zap to char using avy
       (use-package avy-zap
         :straight t
         :bind (("M-z" . avy-zap-to-char-dwim)
                ("M-Z" . avy-zap-up-to-char-dwim)))

       ;; ace-window - Window switching with avy
       (use-package ace-window
         :straight t
         :bind (("C-x o" . ace-window))
         :config
         (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
         (setq aw-scope 'frame)
         (setq aw-dispatch-always t))

       ;; link-hint - Open links with avy
       (use-package link-hint
         :straight t
         :bind (("C-c l o" . link-hint-open-link)
                ("C-c l c" . link-hint-copy-link)))
     #+end_src

** Org

