emacs/dot-emacs.d/config.el

(setq org-goto-auto-isearch nil
      org-M-RET-may-split-lines nil
      org-return-follows-link t
      org-yank-olded-subtrees nil
      org-adapt-indentation t
      org-hide-leading-stars t
      org-hide-emphasis-markers t
      org-pretty-entities t
      org-ellipsis "  ·"
      org-src-fontify-natively t
      org-src-tab-acts-natively t
      org-edit-src-content-indentation 0)

(add-hook 'org-mode-hook 'visual-line-mode)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; (use-package olivetti	       ;;
;;   :hook (org-mode . olivetti-mode)) ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(defun arg-emacs-org-insert-drawer-correctly (arg)
  "Insert a drawer or PROPERTIES drawer with prefix ARG. Places the cursor into
the new drawer."
  (interactive "P")
  (if arg
      (let ((start (point))
	    (org-insert-property-drawer)
	    ;; Find the beginning of the drawer at point or after
	    (goto-char start)
	    (when (re-search-forward ":PROPERTIES:" nil t)
	      ;; Move to line after :PROPERTIES:
	      (forward-line 1)))
	(call-interactively 'org-insert-drawer))))

(define-key org-mode-map (kbd "C-c i")
	    'arg-emacs-org-insert-drawer-correctly)

;; Assign keybinds for moving between links
(with-eval-after-load 'org
  (define-key org-mode-map (kbd "M-n") #'org-next-link)
  (define-key org-mode-map (kbd "M-p") #'prg-previous-link))

(global-set-key (kbd "<f7>")
		'org-tags-view)
(global-set-key (kbd "C-c a")
		#'org-agenda)

(use-package org-modern
  :config
  (setq
   org-auto-align-tags t
   org-tags-column 0
   org-fold-catch-invisible-edits 'show-and-error
   org-special-ctrl-a/e t
   org-insert-heading-respect-content t

   ;; Don't style the following
   org-modern-tag nil
   org-modern-priority nil
   org-modern-todo nil
   org-modern-table nil

   ;; Agenda styling
   org-agenda-tags-column 0
   org-agenda-block-separator ?─
   org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "⭠ now ─────────────────────────────────────────────────")

  (global-org-modern-mode))

(use-package org-superstar
    :straight t
      :custom
;; Use simple bullets that definitely exist in your font
;;(org-superstar-headline-bullets-list '("●" "○" "◆" "◇" "▶" "▷"))
;; Or use these if you want more variety
 (org-superstar-headline-bullets-list '("◉" "○" "✸" "✿" "✤" "✜"))
(org-superstar-remove-leading-stars t)
(org-superstar-leading-bullet ?\s))

(use-package org-contrib
  :straight t)
(require 'ox)

(defvar arg-emacs-org-roam-dir "~/RoamNotes"
  "Variable for Org Roam notes location")

(unless
    (file-directory-p arg-emacs-org-roam-dir)
  (make-directory arg-emacs-org-roam-dir))

(use-package org-roam
  :straight t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory arg-emacs-org-roam-dir)
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
   '(("d" "default" plain
      "%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)))
  :bind (("C-c n l" . org-roam-buffer-toggle)
  	 ("C-c n f" . org-roam-node-find)
  	 ("C-c n i" . org-roam-node-insert)
	 :map org-mode-map
	 ("C-M-i" . completion-at-point))
  :config
  (org-roam-setup))

;; Set database autosync
(org-roam-db-autosync-enable)

(setq org-agenda-files '("~/org/agenda"))

(defvar arg-org-data-dir (expand-file-name "~/org/data")
  "Variable for setting the data directory for org attach")
(unless (file-directory-p arg-org-data-dir)
  (make-directory arg-org-data-dir t))
(if (file-directory-p arg-org-data-dir)
    (setq org-attach-id-dir arg-org-data-dir))

;; COPY and attach files to org headers using dired
(add-hook 'dired-mode-hook
	  (lambda ()
	    (define-key dired-mode-map (kbd "C-c C-x c")
			(lambda ()
			  (interactive)
			  (let ((org-attach-method 'cp))
			    (call-interactively #'org-attach-dired-to-subtree))))))
;; MOVE and attach files to org headers using dired
(add-hook 'dired-mode-hook
	  (lambda ()
	    (define-key dired-mode-map (kbd "C-c C-x m")
			(lambda ()
			  (interactive)
			  (let ((org-attach-method 'mv))
			    (call-interactively #'org-attach-dired-to-subtree))))))

(use-package magit
  :straight t
  :bind (("C-x g" . magit-status)
	 ("C-x M-g" . magit-dispatch)
	 ("C-c M-g" . magit-file-dispatch))
  :config
  (setq magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(use-package git-gutter
  :straight t
  :config
  (global-git-gutter-mode 1))

(use-package git-timemachine
  :straight t
  :bind (("C-x v t" . git-timemachine)))

(use-package forge
  :straight t
  :after magit
  :config
  ;; Gitlab settings
  (setq forge-alist
	 '(("gitlab.com" "gitlab.com/api/v4" "gitlab.com" forge-gitlab-repository)))

  ;; Set number of topics to fetch
  (setq forge-topic-list-limit '(60 . 10))  ; (issues . merge-requests)

  ;; Columns to show in topic list
  (setq forge-topic-list-columns
	 '(("#" 5 forge-topic-list-sort-by-number (:right-align t) number nil)
	   ("Title" 60 t nil title nil)
	   ("State" 6 t nil state nil)
	   ("Updated" 10 t nil updated nil)))

  ;; Auto-fetch notifications
  (setq forge-pull-notifications t)

  ;; Database location
  (setq forge-database-file (expand-file-name "forge-database.sqlite" user-emacs-directory)))

(use-package git-messenger
  :straight t
  :bind ("C-x v p" . git-messenger:popup-message)
  :config
  (setq git-messenger:show-detail t
	git-messenger:use-magit-popup t))

(use-package diff-hl
  :straight t
  :config
  (global-diff-hl-mode)
  (diff-hl-flydiff-mode))
