emacs/dot-emacs.d/config.el

(use-package blamer
  :straight t
  :bind (("s-i" . blamer-show-commit-info)
         ("C-c i" . blamer-show-posframe-commit-info))
  :defer 20
  :custom
  (blamer-idle-time 0.3)
  (blamer-min-offset 70)
  :custom-face
  (blamer-face ((t :foreground "#7a88cf"
                    :background nil
                    :height 140
                    :italic t)))
  :config
  (global-blamer-mode 1))

(use-package eglot
        :straight t
        :hook ((python-mode . eglot-ensure)
      	 (yaml-mode . eglot-ensure))
        :config
        (add-to-list 'eglot-server-programs
                     '(python-mode . ("pyright-langserver" "--stdio")))
        (add-to-list 'eglot-server-programs
                     '(yaml-mode . ("ansible-language-server" "--stdio")))
        (add-hook 'python-mode-hook
      	    (lambda ()
                    (add-hook 'before-save-hook 'eglot-format-buffer nil t)))
          (setq eglot-ignored-server-capabilities 
          '(:workspaceDidChangeConfiguration)))

(use-package sideline
  :straight t
  :hook (flymake-mode . sideline-mode)
  :config
  (setq sideline-flymake-display-mode 'line)
  (setq sideline-backends-right '(sideline-flymake)))

(use-package sideline-flymake
  :straight t
  :after (sideline flymake)
  :hook (flymake-mode . sideline-mode))

      (use-package eldoc-box
        :straight t
        :config
        (defun arg/eldoc-box-scroll-up ()
          "Scroll up in `eldoc-box--frame'"
          (interactive)
          (with-current-buffer eldoc-box--buffer
            (with-selected-frame eldoc-box--frame
              (scroll-down 3))))
        (defun arg/eldoc-box-scroll-down ()
          "Scroll down in `eldoc-box--frame'"
          (interactive)
          (with-current-buffer eldoc-box--buffer
            (with-selected-frame eldoc-box--frame
              (scroll-up 3))))
        :bind
        (:map eglot-mode-map
              ("C-k" . arg/eldoc-box-scroll-up)
              ("C-j" . arg/eldoc-box-scroll-down)
              ("M-h" . eldoc-box-eglot-help-at-point)))

;; (use-package flycheck
;; :straight t
;; :config
;; (add-hook 'after-init-hook #'global-flycheck-mode))

;; (use-package flycheck-eglot
;;   :straight t
;;   :after (flycheck eglot)
;;   :config
;;   (global-flycheck-eglot-mode 1))

;; Ansible Language Server
  (use-package ansible
    :straight t
    :hook ((yaml-mode . ansible)
           (yaml-ts-mode . ansible)))

  (use-package yaml-mode
    :straight t
    :mode (("\\.ya?ml\\'" . yaml-mode)
           ("\\.ansible\\'" . yaml-mode)))

 (use-package ansible-doc
:straight t
:hook (yaml-mode . ansible-doc-mode)
:bind (:map ansible-doc-mode-map
            ("C-c ?" . ansible-doc)))

(add-hook 'yaml-mode-hook
      (lambda ()
        (define-key yaml-mode-map (kbd "RET") 'newline-and-indent)))

(use-package pyvenv
  :straight t
  :config
  (setq pyvenv-mode-line-indicator '(pyvenv-virtual-env-name ("[venv:" pyvenv-virtual-env-name "] "))))

(use-package devdocs
:straight t
:bind (("C-h D" . devdocs-lookup)
       ("C-c d d" . devdocs-lookup))
:config
;; Install docs for your languages
(add-hook 'python-mode-hook
          (lambda () (setq-local devdocs-current-docs '("python~3.13"))))
(add-hook 'yaml-mode-hook
          (lambda () (setq-local devdocs-current-docs '("ansible~2.11"))))
(add-hook 'emacs-lisp-mode-hook
          (lambda () (setq-local devdocs-current-docs '("elisp")))))

(use-package projectile
  :straight t
  :init
  (projectile-mode +1)
  :bind (:map projectile-mode-map
              ("C-c p" . projectile-command-map))
  :config
  (setq projectile-project-search-path '("~/projects/"))
  (setq projectile-completion-system 'default)
  (setq projectile-enable-caching t))

(use-package consult-projectile
  :straight t
  :after (consult projectile)
  :bind (("C-c p f" . consult-projectile-find-file)
         ("C-c p p" . consult-projectile-switch-project)))

(use-package vterm
  :straight t
  :defer t
  :bind (("C-c o t" . vterm-other-window)))

(use-package tempel
  :straight t
  :defer t
  :bind (("M-+" . tempel-complete)
	 ("M-*" . tempel-insert))
  :init
  (defun tempel-setup-capf ()
    (setq-local completion-at-point-functions
		(cons #'tempel-expand
		      completion-at-point-functions)))

  (add-hook 'conf-mode-hook 'tempel-setup-capf)
  (add-hook 'prog-mode-hook 'tempel-setup-capf)
  (add-hook 'text-mode-hook 'tempel-setup-capf))

(use-package tempel-collection
  :straight t)
